## Generated SDC file "ov5640_sdram_vga.sdc"

## Copyright (C) 2018  Intel Corporation. All rights reserved.
## Your use of Intel Corporation's design tools, logic functions 
## and other software and tools, and its AMPP partner logic 
## functions, and any output files from any of the foregoing 
## (including device programming or simulation files), and any 
## associated documentation or information are expressly subject 
## to the terms and conditions of the Intel Program License 
## Subscription Agreement, the Intel Quartus Prime License Agreement,
## the Intel FPGA IP License Agreement, or other applicable license
## agreement, including, without limitation, that your use is for
## the sole purpose of programming logic devices manufactured by
## Intel and sold by Intel or its authorized distributors.  Please
## refer to the applicable agreement for further details.


## VENDOR  "Altera"
## PROGRAM "Quartus Prime"
## VERSION "Version 18.1.0 Build 625 09/12/2018 SJ Standard Edition"

## DATE    "Tue Dec 07 15:01:35 2021"

##
## DEVICE  "5CSXFC6D6F31C6"
##


#**************************************************************
# Time Information
#**************************************************************

set_time_format -unit ns -decimal_places 3



#**************************************************************
# Create Clock
#**************************************************************

create_clock -name {clk} -period 20.000 -waveform { 0.000 10.000 } [get_ports {clk}]
create_clock -name {cmos_pclk} -period 12.000 -waveform { 0.000 6.000 } [get_ports {cmos_pclk}]


#**************************************************************
# Create Generated Clock
#**************************************************************

create_generated_clock -name {u_pll|altpll_component|auto_generated|generic_pll1~FRACTIONAL_PLL|vcoph[0]} -source [get_pins {u_pll|altpll_component|auto_generated|generic_pll1~FRACTIONAL_PLL|refclkin}] -duty_cycle 50/1 -multiply_by 24 -divide_by 2 -master_clock {clk} [get_pins {u_pll|altpll_component|auto_generated|generic_pll1~FRACTIONAL_PLL|vcoph[0]}] 
create_generated_clock -name {u_pll|altpll_component|auto_generated|generic_pll1~PLL_OUTPUT_COUNTER|divclk} -source [get_pins {u_pll|altpll_component|auto_generated|generic_pll1~PLL_OUTPUT_COUNTER|vco0ph[0]}] -duty_cycle 50/1 -multiply_by 1 -divide_by 25 -master_clock {u_pll|altpll_component|auto_generated|generic_pll1~FRACTIONAL_PLL|vcoph[0]} [get_pins {u_pll|altpll_component|auto_generated|generic_pll1~PLL_OUTPUT_COUNTER|divclk}] 
create_generated_clock -name {u_pll|altpll_component|auto_generated|generic_pll2~PLL_OUTPUT_COUNTER|divclk} -source [get_pins {u_pll|altpll_component|auto_generated|generic_pll2~PLL_OUTPUT_COUNTER|vco0ph[0]}] -duty_cycle 50/1 -multiply_by 1 -divide_by 3 -master_clock {u_pll|altpll_component|auto_generated|generic_pll1~FRACTIONAL_PLL|vcoph[0]} [get_pins {u_pll|altpll_component|auto_generated|generic_pll2~PLL_OUTPUT_COUNTER|divclk}] 
create_generated_clock -name {u_pll|altpll_component|auto_generated|generic_pll3~PLL_OUTPUT_COUNTER|divclk} -source [get_pins {u_pll|altpll_component|auto_generated|generic_pll3~PLL_OUTPUT_COUNTER|vco0ph[0]}] -duty_cycle 50/1 -multiply_by 1 -divide_by 8 -master_clock {u_pll|altpll_component|auto_generated|generic_pll1~FRACTIONAL_PLL|vcoph[0]} [get_pins {u_pll|altpll_component|auto_generated|generic_pll3~PLL_OUTPUT_COUNTER|divclk}] 


#**************************************************************
# Set Clock Latency
#**************************************************************



#**************************************************************
# Set Clock Uncertainty
#**************************************************************

set_clock_uncertainty -rise_from [get_clocks {cmos_pclk}] -rise_to [get_clocks {cmos_pclk}] -setup 0.170  
set_clock_uncertainty -rise_from [get_clocks {cmos_pclk}] -rise_to [get_clocks {cmos_pclk}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {cmos_pclk}] -fall_to [get_clocks {cmos_pclk}] -setup 0.170  
set_clock_uncertainty -rise_from [get_clocks {cmos_pclk}] -fall_to [get_clocks {cmos_pclk}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {cmos_pclk}] -rise_to [get_clocks {u_pll|altpll_component|auto_generated|generic_pll2~PLL_OUTPUT_COUNTER|divclk}]  0.190  
set_clock_uncertainty -rise_from [get_clocks {cmos_pclk}] -fall_to [get_clocks {u_pll|altpll_component|auto_generated|generic_pll2~PLL_OUTPUT_COUNTER|divclk}]  0.190  
set_clock_uncertainty -fall_from [get_clocks {cmos_pclk}] -rise_to [get_clocks {cmos_pclk}] -setup 0.170  
set_clock_uncertainty -fall_from [get_clocks {cmos_pclk}] -rise_to [get_clocks {cmos_pclk}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {cmos_pclk}] -fall_to [get_clocks {cmos_pclk}] -setup 0.170  
set_clock_uncertainty -fall_from [get_clocks {cmos_pclk}] -fall_to [get_clocks {cmos_pclk}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {cmos_pclk}] -rise_to [get_clocks {u_pll|altpll_component|auto_generated|generic_pll2~PLL_OUTPUT_COUNTER|divclk}]  0.190  
set_clock_uncertainty -fall_from [get_clocks {cmos_pclk}] -fall_to [get_clocks {u_pll|altpll_component|auto_generated|generic_pll2~PLL_OUTPUT_COUNTER|divclk}]  0.190  
set_clock_uncertainty -rise_from [get_clocks {u_pll|altpll_component|auto_generated|generic_pll3~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {u_pll|altpll_component|auto_generated|generic_pll3~PLL_OUTPUT_COUNTER|divclk}] -setup 0.080  
set_clock_uncertainty -rise_from [get_clocks {u_pll|altpll_component|auto_generated|generic_pll3~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {u_pll|altpll_component|auto_generated|generic_pll3~PLL_OUTPUT_COUNTER|divclk}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {u_pll|altpll_component|auto_generated|generic_pll3~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {u_pll|altpll_component|auto_generated|generic_pll3~PLL_OUTPUT_COUNTER|divclk}] -setup 0.080  
set_clock_uncertainty -rise_from [get_clocks {u_pll|altpll_component|auto_generated|generic_pll3~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {u_pll|altpll_component|auto_generated|generic_pll3~PLL_OUTPUT_COUNTER|divclk}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {u_pll|altpll_component|auto_generated|generic_pll3~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {u_pll|altpll_component|auto_generated|generic_pll2~PLL_OUTPUT_COUNTER|divclk}] -setup 0.080  
set_clock_uncertainty -rise_from [get_clocks {u_pll|altpll_component|auto_generated|generic_pll3~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {u_pll|altpll_component|auto_generated|generic_pll2~PLL_OUTPUT_COUNTER|divclk}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {u_pll|altpll_component|auto_generated|generic_pll3~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {u_pll|altpll_component|auto_generated|generic_pll2~PLL_OUTPUT_COUNTER|divclk}] -setup 0.080  
set_clock_uncertainty -rise_from [get_clocks {u_pll|altpll_component|auto_generated|generic_pll3~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {u_pll|altpll_component|auto_generated|generic_pll2~PLL_OUTPUT_COUNTER|divclk}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {u_pll|altpll_component|auto_generated|generic_pll3~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {u_pll|altpll_component|auto_generated|generic_pll3~PLL_OUTPUT_COUNTER|divclk}] -setup 0.080  
set_clock_uncertainty -fall_from [get_clocks {u_pll|altpll_component|auto_generated|generic_pll3~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {u_pll|altpll_component|auto_generated|generic_pll3~PLL_OUTPUT_COUNTER|divclk}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {u_pll|altpll_component|auto_generated|generic_pll3~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {u_pll|altpll_component|auto_generated|generic_pll3~PLL_OUTPUT_COUNTER|divclk}] -setup 0.080  
set_clock_uncertainty -fall_from [get_clocks {u_pll|altpll_component|auto_generated|generic_pll3~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {u_pll|altpll_component|auto_generated|generic_pll3~PLL_OUTPUT_COUNTER|divclk}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {u_pll|altpll_component|auto_generated|generic_pll3~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {u_pll|altpll_component|auto_generated|generic_pll2~PLL_OUTPUT_COUNTER|divclk}] -setup 0.080  
set_clock_uncertainty -fall_from [get_clocks {u_pll|altpll_component|auto_generated|generic_pll3~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {u_pll|altpll_component|auto_generated|generic_pll2~PLL_OUTPUT_COUNTER|divclk}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {u_pll|altpll_component|auto_generated|generic_pll3~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {u_pll|altpll_component|auto_generated|generic_pll2~PLL_OUTPUT_COUNTER|divclk}] -setup 0.080  
set_clock_uncertainty -fall_from [get_clocks {u_pll|altpll_component|auto_generated|generic_pll3~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {u_pll|altpll_component|auto_generated|generic_pll2~PLL_OUTPUT_COUNTER|divclk}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {u_pll|altpll_component|auto_generated|generic_pll2~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {cmos_pclk}]  0.190  
set_clock_uncertainty -rise_from [get_clocks {u_pll|altpll_component|auto_generated|generic_pll2~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {cmos_pclk}]  0.190  
set_clock_uncertainty -rise_from [get_clocks {u_pll|altpll_component|auto_generated|generic_pll2~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {u_pll|altpll_component|auto_generated|generic_pll3~PLL_OUTPUT_COUNTER|divclk}] -setup 0.080  
set_clock_uncertainty -rise_from [get_clocks {u_pll|altpll_component|auto_generated|generic_pll2~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {u_pll|altpll_component|auto_generated|generic_pll3~PLL_OUTPUT_COUNTER|divclk}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {u_pll|altpll_component|auto_generated|generic_pll2~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {u_pll|altpll_component|auto_generated|generic_pll3~PLL_OUTPUT_COUNTER|divclk}] -setup 0.080  
set_clock_uncertainty -rise_from [get_clocks {u_pll|altpll_component|auto_generated|generic_pll2~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {u_pll|altpll_component|auto_generated|generic_pll3~PLL_OUTPUT_COUNTER|divclk}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {u_pll|altpll_component|auto_generated|generic_pll2~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {u_pll|altpll_component|auto_generated|generic_pll2~PLL_OUTPUT_COUNTER|divclk}] -setup 0.080  
set_clock_uncertainty -rise_from [get_clocks {u_pll|altpll_component|auto_generated|generic_pll2~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {u_pll|altpll_component|auto_generated|generic_pll2~PLL_OUTPUT_COUNTER|divclk}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {u_pll|altpll_component|auto_generated|generic_pll2~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {u_pll|altpll_component|auto_generated|generic_pll2~PLL_OUTPUT_COUNTER|divclk}] -setup 0.080  
set_clock_uncertainty -rise_from [get_clocks {u_pll|altpll_component|auto_generated|generic_pll2~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {u_pll|altpll_component|auto_generated|generic_pll2~PLL_OUTPUT_COUNTER|divclk}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {u_pll|altpll_component|auto_generated|generic_pll2~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {cmos_pclk}]  0.190  
set_clock_uncertainty -fall_from [get_clocks {u_pll|altpll_component|auto_generated|generic_pll2~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {cmos_pclk}]  0.190  
set_clock_uncertainty -fall_from [get_clocks {u_pll|altpll_component|auto_generated|generic_pll2~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {u_pll|altpll_component|auto_generated|generic_pll3~PLL_OUTPUT_COUNTER|divclk}] -setup 0.080  
set_clock_uncertainty -fall_from [get_clocks {u_pll|altpll_component|auto_generated|generic_pll2~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {u_pll|altpll_component|auto_generated|generic_pll3~PLL_OUTPUT_COUNTER|divclk}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {u_pll|altpll_component|auto_generated|generic_pll2~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {u_pll|altpll_component|auto_generated|generic_pll3~PLL_OUTPUT_COUNTER|divclk}] -setup 0.080  
set_clock_uncertainty -fall_from [get_clocks {u_pll|altpll_component|auto_generated|generic_pll2~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {u_pll|altpll_component|auto_generated|generic_pll3~PLL_OUTPUT_COUNTER|divclk}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {u_pll|altpll_component|auto_generated|generic_pll2~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {u_pll|altpll_component|auto_generated|generic_pll2~PLL_OUTPUT_COUNTER|divclk}] -setup 0.080  
set_clock_uncertainty -fall_from [get_clocks {u_pll|altpll_component|auto_generated|generic_pll2~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {u_pll|altpll_component|auto_generated|generic_pll2~PLL_OUTPUT_COUNTER|divclk}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {u_pll|altpll_component|auto_generated|generic_pll2~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {u_pll|altpll_component|auto_generated|generic_pll2~PLL_OUTPUT_COUNTER|divclk}] -setup 0.080  
set_clock_uncertainty -fall_from [get_clocks {u_pll|altpll_component|auto_generated|generic_pll2~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {u_pll|altpll_component|auto_generated|generic_pll2~PLL_OUTPUT_COUNTER|divclk}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {clk}] -rise_to [get_clocks {cmos_pclk}]  0.170  
set_clock_uncertainty -rise_from [get_clocks {clk}] -fall_to [get_clocks {cmos_pclk}]  0.170  
set_clock_uncertainty -rise_from [get_clocks {clk}] -rise_to [get_clocks {u_pll|altpll_component|auto_generated|generic_pll3~PLL_OUTPUT_COUNTER|divclk}]  0.190  
set_clock_uncertainty -rise_from [get_clocks {clk}] -fall_to [get_clocks {u_pll|altpll_component|auto_generated|generic_pll3~PLL_OUTPUT_COUNTER|divclk}]  0.190  
set_clock_uncertainty -rise_from [get_clocks {clk}] -rise_to [get_clocks {clk}] -setup 0.170  
set_clock_uncertainty -rise_from [get_clocks {clk}] -rise_to [get_clocks {clk}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {clk}] -fall_to [get_clocks {clk}] -setup 0.170  
set_clock_uncertainty -rise_from [get_clocks {clk}] -fall_to [get_clocks {clk}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {clk}] -rise_to [get_clocks {cmos_pclk}]  0.170  
set_clock_uncertainty -fall_from [get_clocks {clk}] -fall_to [get_clocks {cmos_pclk}]  0.170  
set_clock_uncertainty -fall_from [get_clocks {clk}] -rise_to [get_clocks {u_pll|altpll_component|auto_generated|generic_pll3~PLL_OUTPUT_COUNTER|divclk}]  0.190  
set_clock_uncertainty -fall_from [get_clocks {clk}] -fall_to [get_clocks {u_pll|altpll_component|auto_generated|generic_pll3~PLL_OUTPUT_COUNTER|divclk}]  0.190  
set_clock_uncertainty -fall_from [get_clocks {clk}] -rise_to [get_clocks {clk}] -setup 0.170  
set_clock_uncertainty -fall_from [get_clocks {clk}] -rise_to [get_clocks {clk}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {clk}] -fall_to [get_clocks {clk}] -setup 0.170  
set_clock_uncertainty -fall_from [get_clocks {clk}] -fall_to [get_clocks {clk}] -hold 0.060  


#**************************************************************
# Set Input Delay
#**************************************************************



#**************************************************************
# Set Output Delay
#**************************************************************



#**************************************************************
# Set Clock Groups
#**************************************************************



#**************************************************************
# Set False Path
#**************************************************************

set_false_path -from [get_keepers {*rdptr_g*}] -to [get_keepers {*ws_dgrp|dffpipe_ue9:dffpipe9|dffe10a*}]
set_false_path -from [get_keepers {*delayed_wrptr_g*}] -to [get_keepers {*rs_dgwp|dffpipe_te9:dffpipe6|dffe7a*}]
set_false_path -from [get_keepers {*rdptr_g*}] -to [get_keepers {*ws_dgrp|dffpipe_se9:dffpipe16|dffe17a*}]
set_false_path -from [get_keepers {*delayed_wrptr_g*}] -to [get_keepers {*rs_dgwp|dffpipe_re9:dffpipe13|dffe14a*}]


#**************************************************************
# Set Multicycle Path
#**************************************************************



#**************************************************************
# Set Maximum Delay
#**************************************************************



#**************************************************************
# Set Minimum Delay
#**************************************************************



#**************************************************************
# Set Input Transition
#**************************************************************

